_posts/2017-10-11-english.md
<div class="HTML">
<p>
&#x2014;
layout: default
title: The English Knowledge You Must Know
&#x2014;
</p>

</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf82fc02">1. free</a>
<ul>
<li><a href="#org4843695">1.1. be free to do/be</a></li>
<li><a href="#org4f7b076">1.2. free with</a></li>
<li><a href="#org08e51ab">1.3. free of</a></li>
<li><a href="#org23c16d4">1.4. free from</a></li>
</ul>
</li>
<li><a href="#orgd714a42">2. read</a>
<ul>
<li><a href="#orgd451cf0">2.1. read</a></li>
<li><a href="#orgcc7d9ec">2.2. read of</a></li>
<li><a href="#org75d34af">2.3. draw out</a></li>
<li><a href="#org892260f">2.4. 拔出、掏出</a></li>
<li><a href="#org386eda7">2.5. 发掘、挖掘</a></li>
<li><a href="#org8f6a42e">2.6. 抽出、拉长</a></li>
<li><a href="#orga104c35">2.7. care about &amp; care for</a></li>
<li><a href="#orgf8c65e6">2.8. care about</a></li>
<li><a href="#org98f6109">2.9. care for</a></li>
</ul>
</li>
<li><a href="#org4860a16">3. involve</a>
<ul>
<li><a href="#org483859f">3.1. 及物动词</a></li>
<li><a href="#orgd5b9581">3.2. 不及物动词</a></li>
</ul>
</li>
<li><a href="#org8848e48">4. cease</a>
<ul>
<li><a href="#orgcd8914e">4.1. cease to do</a></li>
<li><a href="#org9e2c4e9">4.2. cease doning</a></li>
</ul>
</li>
<li><a href="#org4e598e6">5. take leave</a>
<ul>
<li><a href="#org9eeec4f">5.1. take leave</a></li>
<li><a href="#org71f521c">5.2. take leave to</a></li>
<li><a href="#org73bc3bf">5.3. 表示“冒昧做”的固定搭配</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf82fc02" class="outline-2">
<h2 id="orgf82fc02"><span class="section-number-2">1</span> free</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4843695" class="outline-3">
<h3 id="org4843695"><span class="section-number-3">1.1</span> be free to do/be</h3>
<div class="outline-text-3" id="text-1-1">
<p>
自由地做/成为&#x2026;
</p>
<ul class="org-ul">
<li>On Facebook, you can <b>be free to be</b> who you want to be, as long as you don't mind being bombarded by adverts for the world's biggest brands.</li>
<li>In Istanbul, women should <b>be free to</b> pursue happines and live as they choose, instead of being confined by traditional marriage values, she said.</li>
</ul>
</div>
</div>
<div id="outline-container-org4f7b076" class="outline-3">
<h3 id="org4f7b076"><span class="section-number-3">1.2</span> free with</h3>
<div class="outline-text-3" id="text-1-2">
<p>
对&#x2026;很随意、随便，强调的是“对某事不认真”
</p>
<ul class="org-ul">
<li>You are too <b>free with</b> your manners.</li>
<li>It seems people become very <b>free with</b> their money these days.</li>
</ul>
</div>
</div>
<div id="outline-container-org08e51ab" class="outline-3">
<h3 id="org08e51ab"><span class="section-number-3">1.3</span> free of</h3>
<div class="outline-text-3" id="text-1-3">
<p>
免除&#x2026;，通常指免除租金、债务
</p>
<ul class="org-ul">
<li>He lived in a flat <b>free of</b> rent.</li>
<li>Westin is rolling out a program at all of its hotels in which guest can borrow New Balence sneakers and workout gear <b>free of</b> charge.</li>
</ul>
</div>
</div>
<div id="outline-container-org23c16d4" class="outline-3">
<h3 id="org23c16d4"><span class="section-number-3">1.4</span> free from</h3>
<div class="outline-text-3" id="text-1-4">
<p>
摆脱&#x2026;，从疾病、惧怕、危险或错误等消失或好转，强调从负面的时间中好转
</p>
<ul class="org-ul">
<li>Even the wise are not always <b>free from</b> error.</li>
<li>You may have another certificate showing the goods to be <b>free from</b> radioactive contamination.</li>
<li>The Thai economy, like many in Asia, sprang <b>free from</b> the great recession surprisingly quickly.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd714a42" class="outline-2">
<h2 id="orgd714a42"><span class="section-number-2">2</span> read</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd451cf0" class="outline-3">
<h3 id="orgd451cf0"><span class="section-number-3">2.1</span> read</h3>
<div class="outline-text-3" id="text-2-1">
<p>
除了“读、读书”，还有“察觉、了解”的意思
</p>
<ul class="org-ul">
<li>They're pretty intuitive, and they can see it, they can <b>read</b> it.</li>
<li>Mr Lorry's bussiness eye <b>read</b> in the speaker's face that is was loss of time to dwell upon the point.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc7d9ec" class="outline-3">
<h3 id="orgcc7d9ec"><span class="section-number-3">2.2</span> read of</h3>
<div class="outline-text-3" id="text-2-2">
<p>
熟悉，了解
</p>
<ul class="org-ul">
<li>I <b>read of</b> the superstar's marriage in today's newspaper.</li>
<li>She had, I presume, <b>read of</b> how Garfield, Lincoln, and other Americans rose from poverty to fame and greatness.</li>
</ul>
</div>
</div>
<div id="outline-container-org75d34af" class="outline-3">
<h3 id="org75d34af"><span class="section-number-3">2.3</span> draw out</h3>
</div>
<div id="outline-container-org892260f" class="outline-3">
<h3 id="org892260f"><span class="section-number-3">2.4</span> 拔出、掏出</h3>
<div class="outline-text-3" id="text-2-4">
<p>
draw为及物动词
</p>
<ul class="org-ul">
<li>He put a knife in a man and <b>drew</b> it out.</li>
</ul>
</div>
</div>
<div id="outline-container-org386eda7" class="outline-3">
<h3 id="org386eda7"><span class="section-number-3">2.5</span> 发掘、挖掘</h3>
<div class="outline-text-3" id="text-2-5">
<p>
draw为不及物动词
</p>
<ul class="org-ul">
<li>It's importent to <b>draw out</b> a child's pontential capacities.</li>
<li>The teacher helped to <b>draw out</b> the meaning of the poem.</li>
</ul>
</div>
</div>
<div id="outline-container-org8f6a42e" class="outline-3">
<h3 id="org8f6a42e"><span class="section-number-3">2.6</span> 抽出、拉长</h3>
<div class="outline-text-3" id="text-2-6">
<p>
draw通常为及物动词
</p>
<ul class="org-ul">
<li>The days begin to <b>draw out</b> after the winter solstice.</li>
<li>She <b>drew</b> the interview <b>out</b> to over an hour.</li>
</ul>
</div>
</div>
<div id="outline-container-orga104c35" class="outline-3">
<h3 id="orga104c35"><span class="section-number-3">2.7</span> care about &amp; care for</h3>
<div class="outline-text-3" id="text-2-7">
<p>
take care of sb, "照顾、照料某人"
</p>
</div>
</div>
<div id="outline-container-orgf8c65e6" class="outline-3">
<h3 id="orgf8c65e6"><span class="section-number-3">2.8</span> care about</h3>
<div class="outline-text-3" id="text-2-8">
<p>
care用作谓语动词，与about搭配，表示feel interested in / be concerned about, “关心、担心、在乎”
</p>
<ul class="org-ul">
<li>If I <b>care about</b> you, I'm concerned about your growth, and I hope you will become all that you can become.</li>
<li>The world has to <b>care about</b> American's growth, since it is the importent driver of the global economy.</li>
</ul>
</div>
</div>
<div id="outline-container-org98f6109" class="outline-3">
<h3 id="org98f6109"><span class="section-number-3">2.9</span> care for</h3>
<div class="outline-text-3" id="text-2-9">
<p>
既可以表示“照顾、看护某人”，也可以表示“喜欢、想得到某物”
</p>
<ul class="org-ul">
<li>Brave Isabel, the poor little girl whose father gave up his life to <b>care for</b> her.</li>
<li>To <b>care for</b> wisdom and truth and the improvement of the soul is far better than to seek money and honour and reputation.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4860a16" class="outline-2">
<h2 id="org4860a16"><span class="section-number-2">3</span> involve</h2>
<div class="outline-text-2" id="text-3">
<p>
involve既可以作及物动词，也可以做不及物动词，差别很大
</p>
</div>
<div id="outline-container-org483859f" class="outline-3">
<h3 id="org483859f"><span class="section-number-3">3.1</span> 及物动词</h3>
<div class="outline-text-3" id="text-3-1">
<p>
表"包含、涉及"
</p>
<ul class="org-ul">
<li>However, the <b>innovation</b> can involve plenty of clever gadgets and gizmos.</li>
<li>Intercultrue communication <b>involves</b> different perceptions, attitudes and interpretations.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd5b9581" class="outline-3">
<h3 id="orgd5b9581"><span class="section-number-3">3.2</span> 不及物动词</h3>
<div class="outline-text-3" id="text-3-2">
<p>
其固定搭配是be involved in或get involved in, 表示"卷入、干涉、参与"
</p>
<ul class="org-ul">
<li>By then, World War II had ended, but the United States <b>was involved in</b> the Korean War, so Starr decieded to become a military doctor.</li>
<li>Many nations around the world <b>are involved in</b> border disputs which have resulted in strained military relations.</li>
<li>Din't I say somethins about you not <b>getting involved in</b> that?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8848e48" class="outline-2">
<h2 id="org8848e48"><span class="section-number-2">4</span> cease</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgcd8914e" class="outline-3">
<h3 id="orgcd8914e"><span class="section-number-3">4.1</span> cease to do</h3>
<div class="outline-text-3" id="text-4-1">
<p>
强调“长时间甚至永远停止做某事”
</p>
<ul class="org-ul">
<li>Your voice service provider will soon <b>cease to</b> provide service.</li>
<li>The great tragedy of life is not that men perish, but that they <b>cease to</b> love.</li>
</ul>
</div>
</div>
<div id="outline-container-org9e2c4e9" class="outline-3">
<h3 id="org9e2c4e9"><span class="section-number-3">4.2</span> cease doning</h3>
<div class="outline-text-3" id="text-4-2">
<p>
强调“短时停止做某事，但以后还会接着做”
</p>
<ul class="org-ul">
<li>Never <b>cease trying</b> to be the best you can be &#x2013; that's under your control.</li>
<li>Moscow would also <b>cease issuing</b> visas to British officials &#x2013; although he insisted other visa applications would not be affected.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4e598e6" class="outline-2">
<h2 id="org4e598e6"><span class="section-number-2">5</span> take leave</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9eeec4f" class="outline-3">
<h3 id="org9eeec4f"><span class="section-number-3">5.1</span> take leave</h3>
<div class="outline-text-3" id="text-5-1">
<p>
告别、离开，或休假
</p>
<ul class="org-ul">
<li>The guest <b>took leave</b> after thanking the host.</li>
<li>The goverment has tried to address the problem by promoting telecommuting and encouraging workers to <b>take leave</b> when they start families or need to care for elderly parents.</li>
</ul>
</div>
</div>
<div id="outline-container-org71f521c" class="outline-3">
<h3 id="org71f521c"><span class="section-number-3">5.2</span> take leave to</h3>
<div class="outline-text-3" id="text-5-2">
<p>
冒昧做。。。
</p>
<ul class="org-ul">
<li>I <b>take leave to</b> be frank.</li>
<li>I <b>take leave to</b> differ from you.</li>
</ul>
</div>
</div>
<div id="outline-container-org73bc3bf" class="outline-3">
<h3 id="org73bc3bf"><span class="section-number-3">5.3</span> 表示“冒昧做”的固定搭配</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>We <b>take liberty of</b> writing to you with a view to establish bussiness relations with you.</li>
<li>May I <b>make so bold to</b> ask what institution sponsored your experiment?</li>
<li>I <b>ventured to</b> say something of the kind to her, when she laughed at my clumsy compliment and said I had better take to writing fashion articles instead of political leaders.</li>
<li>I know my place and I wouldn't <b>presume to</b> tell an expert how to do his job.</li>
</ul>
</div>
</div>
</div>
